docs/klqp.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-12-05 Tue 23:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Hierarchical model in Edward</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Abhishek Sarkar">
<link href="https://maxcdn.bootstrapcdn.com/bootswatch/3.3.7/cosmo/bootstrap.min.css" rel="stylesheet" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Hierarchical model in Edward</h1>

<div id="outline-container-org8c38f82" class="outline-2">
<h2 id="org8c38f82">Setup</h2>
<div class="outline-text-2" id="text-org8c38f82">
<div class="org-src-container">
<pre class="src src-ipython"><span class="org-keyword">import</span> edward <span class="org-keyword">as</span> ed
<span class="org-keyword">from</span> edward.models <span class="org-keyword">import</span> Normal
<span class="org-keyword">import</span> numpy <span class="org-keyword">as</span> np
<span class="org-keyword">import</span> tensorflow <span class="org-keyword">as</span> tf
</pre>
</div>
</div>
</div>

<div id="outline-container-org552034d" class="outline-2">
<h2 id="org552034d">Data</h2>
<div class="outline-text-2" id="text-org552034d">
<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">N</span> = 3  <span class="org-comment-delimiter"># </span><span class="org-comment">number of groups</span>
<span class="org-variable-name">M</span> = 1000  <span class="org-comment-delimiter"># </span><span class="org-comment">samples per group</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">mean for each group is different</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">want to infer the group means plus the overall mean</span>
<span class="org-variable-name">actual_group_means</span> = [0.1, 0.2, 0.3]
<span class="org-variable-name">sigma</span> = 0.1

<span class="org-variable-name">observed_groups</span> = np.repeat([0, 1, 2], M)
<span class="org-variable-name">samples</span> = [np.random.normal(actual_group_means[g], sigma, M) <span class="org-keyword">for</span> g <span class="org-keyword">in</span> <span class="org-builtin">range</span>(N)]
<span class="org-variable-name">observed_data</span> = np.concatenate(samples)
</pre>
</div>
</div>
</div>

<div id="outline-container-org807fc43" class="outline-2">
<h2 id="org807fc43">Model</h2>
<div class="outline-text-2" id="text-org807fc43">
<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">groups</span> = tf.placeholder(tf.int32, [M * N])

<span class="org-variable-name">overall_mean</span> = Normal(
  loc=tf.zeros(1), 
  scale=tf.ones(1) * 0.05
)
<span class="org-variable-name">q_overall_mean</span> = Normal(
  loc=tf.Variable(tf.zeros(1)),
  scale=tf.nn.softplus(tf.Variable(tf.zeros(1)))
)

<span class="org-variable-name">group_means</span> = Normal(
  loc=tf.ones(N) * overall_mean,
  scale=tf.ones(N) * 0.05
)
<span class="org-variable-name">q_group_means</span> = Normal(
  loc=tf.Variable(tf.zeros(N)),
  scale=tf.nn.softplus(tf.Variable(tf.zeros(N)))
)

<span class="org-variable-name">data</span> = Normal(
  loc=tf.gather(group_means, groups),
  scale=tf.ones(shape=[N * M]) * sigma
)
</pre>
</div>
</div>
</div>

<div id="outline-container-orga63a45b" class="outline-2">
<h2 id="orga63a45b">Inference</h2>
<div class="outline-text-2" id="text-orga63a45b">
<div class="org-src-container">
<pre class="src src-ipython"><span class="org-keyword">for</span> inference_alg <span class="org-keyword">in</span> (ed.ReparameterizationKLqp, ed.ReparameterizationKLKLqp):
  <span class="org-variable-name">inference</span> = inference_alg(
    {
      overall_mean: q_overall_mean,
      group_means: q_group_means
    },
    data={
      groups: observed_groups,
      data: observed_data
    }
  )
  inference.run(n_samples=5, n_iter=1000)
  <span class="org-variable-name">sess</span> = ed.get_session()
  <span class="org-keyword">print</span>(<span class="org-string">'Using {}:'</span>.<span class="org-builtin">format</span>(inference_alg))
  <span class="org-keyword">print</span>(q_overall_mean.mean().<span class="org-builtin">eval</span>())
  <span class="org-keyword">print</span>(q_group_means.mean().<span class="org-builtin">eval</span>())
</pre>
</div>

<pre class="example">
Using &lt;class 'edward.inferences.klqp.ReparameterizationKLqp'&gt;:
[ 0.15242636]
[ 0.08973102  0.20209159  0.30212268]
Using &lt;class 'edward.inferences.klqp.ReparameterizationKLKLqp'&gt;:
[ 0.]
[ 0.07926108  0.18680389  0.30515084]
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abhishek Sarkar</p>
<p class="date">Created: 2017-12-05 Tue 23:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
